// разметка, step что бы красиво в отчете было
// build - clean очистить старый алюр отчет
// запускаем тест
// other - allureServe - новый отчет получаем

//«лямбда степы»  step("   ", () -> {
//
//        });
//аттачмент в виде снапшота страницы.
package io.github.guru.allure;

// разметка тестов
// удобно когда с нуля проект
//Статическая информация - это редко изменяемая информация, которая выводится непосредственно в тексте самой страницы сайта вручную контент-менеджером.
//Динамическая информация - это часто изменяемая однотипная информация, выводимая на страницах сайта с помощью специальных программных компонентов системы.
//Статическая информация – эта информация, как правило, находится на самом сайте и хранится в файле, она редко изменяется и редактируется на самой странице сайта через визуальный редактор.
// Примеры: статья о компании, контактная информация, рекламный текст и т. д.
//
//Динамическая информация – эта информация выводится из базы данных компонентами системы, она часто изменяется или дополняется.
// Примеры: фотогалерея, новости, каталог товаров или услуг и т.д.


import io.qameta.allure.*;
import org.junit.jupiter.api.DisplayName;
import org.junit.jupiter.api.Test;

import static com.codeborne.selenide.Selenide.open;
import static io.qameta.allure.Allure.*;

@Feature("Issue")
@Owner("osetrova") // кто тест писал в отчтете

public class AnnotatedLabelsest {


    @Test
    @Story("Поиск по Issue") // название в алюре
    @Link(name = "Главная страница", url="https://github.com") // сслыка в отчете на страницу
    @DisplayName("Проверка того, что мы можем поискать конкретную Issue") // название теста
    @Severity(SeverityLevel.BLOCKER) // Критичность теста
    public void testGithub() {
        step("Открываем главную страницу", () -> {
            open("https://github.com");
            addAttachment("Hello", "World");

        });

    }
}